Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) {
                if (edit_off_h > step) edit_off_h -= step;
                else edit_off_h = 0;
            } else {
                if (edit_off_m > step) edit_off_m -= step;
                else edit_off_m = 0;
            }
            break;

        case UI_TIMER_EDIT_GAP:
            if (edit_gap_min > step) edit_gap_min -= step;
            else edit_gap_min = 0;
            break;

        case UI_AUTO_EDIT_GAP:
            if (edit_auto_gap_s > step) edit_auto_gap_s -= step;
            else edit_auto_gap_s = 0;
            break;

        case UI_AUTO_EDIT_MAXRUN:
            if (edit_auto_maxrun_min > step) edit_auto_maxrun_min -= step;
            else edit_auto_maxrun_min = 0;
            break;

        case UI_AUTO_EDIT_RETRY:
            if (edit_auto_retry > step) edit_auto_retry -= step;
            else edit_auto_retry = 0;
            break;

        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s > step) edit_settings_gap_s -= step;
            else edit_settings_gap_s = 0;
            break;

        case UI_SETTINGS_RETRY:
            if (edit_settings_retry > step) edit_settings_retry -= step;
            else edit_settings_retry = 0;
            break;

        case UI_SETTINGS_OL:
            if (edit_settings_ol > step) edit_settings_ol -= step;
            else edit_settings_ol = 0;
            break;

        case UI_SETTINGS_UL:
            if (edit_settings_ul > step) edit_settings_ul -= step;
            else edit_settings_ul = 0;
            break;

        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun > step) edit_settings_maxrun -= step;
            else edit_settings_maxrun = 0;
            break;

        case UI_DEVSET_EDIT_DATE:
            if (edit_date_field == 0) {
                if (edit_date_dd > step) edit_date_dd -= step;
                else edit_date_dd = 1;
            }
            else if (edit_date_field == 1) {
                if (edit_date_mm > step) edit_date_mm -= step;
                else edit_date_mm = 1;
            }
            else {
                if (edit_date_yyyy > (2000 + step))
                    edit_date_yyyy -= step;
                else
                    edit_date_yyyy = 2000;
            }
            break;

        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) {
                if (edit_time_hh > step) edit_time_hh -= step;
                else edit_time_hh = 0;
            }
            else {
                if (edit_time_min > step) edit_time_min -= step;
                else edit_time_min = 0;
            }
            break;

        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 6) % 7);
            break;

        default:
            break;
    }
}

static UiButton decode_button_press(void)
{
    static bool last_raw[4] = {0};
    static bool stable_state[4] = {0};
    static uint32_t last_change_time[4] = {0};
    static uint32_t press_time[4] = {0};
    static bool long_sent[4] = {0};
    static uint32_t last_repeat_time[4] = {0};

    uint32_t now = HAL_GetTick();

    for (int i = 0; i < 4; i++)
    {
        bool raw = Switch_IsPressed(i);
        if (raw != last_raw[i])
        {
            last_change_time[i] = now;
            last_raw[i] = raw;
        }
        if ((now - last_change_time[i]) > DEBOUNCE_MS)
        {
            if (stable_state[i] != raw)
            {
                stable_state[i] = raw;

                if (raw)  /* Button Pressed */
                {
                    press_time[i] = now;
                    long_sent[i] = false;
                }
                else      /* Button Released */
                {
                    /* If long not already sent → short press */
                    if (!long_sent[i])
                    {
                        switch (i)
                        {
                            case 0: return BTN_RESET;
                            case 1: return BTN_SELECT;
                            case 2: return BTN_UP;
                            case 3: return BTN_DOWN;
                        }
                    }
                }
            }
        }

        /* ================= LONG PRESS + AUTO REPEAT ================= */
        if (stable_state[i])  /* Button is being held */
        {
            /* -------- First Long Press -------- */
            if (!long_sent[i])
            {
                if ((now - press_time[i]) >= LONG_PRESS_MS)
                {
                    long_sent[i] = true;
                    last_repeat_time[i] = now;

                    switch (i)
                    {
                        case 0: return BTN_RESET_LONG;
                        case 1: return BTN_SELECT_LONG;
                        case 2: return BTN_UP_LONG;
                        case 3: return BTN_DOWN_LONG;
                    }
                }
            }
            /* -------- Continuous Repeat -------- */
            else
            {
                if ((now - last_repeat_time[i]) >= REPEAT_INTERVAL_MS)
                {
                    last_repeat_time[i] = now;

                    /* Repeat only for UP and DOWN */
                    switch (i)
                    {
                        case 2: return BTN_UP;
                        case 3: return BTN_DOWN;
                        default: break;
                    }
                }
            }
        }
    }

    return BTN_NONE;
}

void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    uint32_t now = HAL_GetTick();

    if (b == BTN_NONE)
        return;

    refreshInactivityTimer();

    /* ================= RESET BUTTON ================= */
    if (b == BTN_RESET)
    {
        if (ui == UI_DASH)
        {
            ModelHandle_StartRestart();
        }
        else
        {
            switch (ui)
            {
                case UI_SETTINGS_GAP:
                case UI_SETTINGS_RETRY:
                case UI_SETTINGS_UV:
                case UI_SETTINGS_OV:
                case UI_SETTINGS_OL:
                case UI_SETTINGS_UL:
                case UI_SETTINGS_MAXRUN:
                case UI_SETTINGS_PWRREST:
                case UI_SETTINGS_FACTORY:
                case UI_DEVSET_EDIT_DATE:
                case UI_DEVSET_EDIT_TIME:
                case UI_DEVSET_EDIT_DAY:
                    ui = UI_DEVSET_MENU;
                    break;

