Amiya200/stm32_water_tank/Core/Src/screen.c
                case UI_DEVSET_MENU:
                case UI_ADD_DEVICE_MENU:
                case UI_ADD_DEVICE_PAIR:
                case UI_ADD_DEVICE_REMOVE:
                case UI_ADD_DEVICE_PAIR_DONE:
                case UI_ADD_DEVICE_REMOVE_DONE:
                    ui = UI_MENU;
                    break;

                case UI_COUNTDOWN_EDIT_MIN:
                    ui = UI_COUNTDOWN;
                    break;

                case UI_COUNTDOWN:
                    ModelHandle_StopCountdown();
                    ui = UI_DASH;
                    break;

                default:
                    ui = UI_DASH;
                    break;
            }
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ================= RESET CONFIRM ================= */
    if (ui == UI_RESET_CONFIRM)
    {
        if (b == BTN_UP || b == BTN_DOWN)
            reset_confirm_yes = !reset_confirm_yes;
        else if (b == BTN_SELECT)
        {
            if (reset_confirm_yes)
                ModelHandle_FactoryReset();

            ui = UI_DASH;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ================= COUNTDOWN SCREEN ================= */
    if (ui == UI_COUNTDOWN)
    {
        if (b == BTN_DOWN)   // Short press toggles OFF
        {
            ModelHandle_StopCountdown();
            ui = UI_DASH;
        }
        else if (b == BTN_DOWN_LONG && !countdownActive)
        {
            ui = UI_COUNTDOWN_EDIT_MIN;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ================= DASH SCREEN ================= */
    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                break;

            case BTN_SELECT:
                if (!autoActive)
                    ModelHandle_StartAuto(edit_auto_gap_s,
                                          edit_auto_maxrun_min,
                                          edit_auto_retry);
                else
                    ModelHandle_StopAuto();
                break;

            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                menu_view_top = 0;
                break;

            case BTN_UP:
                if (!timerActive)
                    ModelHandle_StartTimerNearestSlot();
                else
                    ModelHandle_StopTimer();
                break;

            case BTN_UP_LONG:
                if (!semiAutoActive)
                    ModelHandle_StartSemiAuto();
                else
                    ModelHandle_StopSemiAuto();
                break;

            case BTN_DOWN:
                if (!countdownActive)
                {
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                    ui = UI_COUNTDOWN;
                }
                else
                {
                    ModelHandle_StopCountdown();
                    ui = UI_DASH;
                }
                break;

            case BTN_DOWN_LONG:
                if (!countdownActive)
                {
                    edit_countdown_min = 1;
                    ui = UI_COUNTDOWN_EDIT_MIN;
                }
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ================= MAIN MENU ================= */
    if (ui == UI_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
            menu_select();
        else if (b == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1)
            menu_idx++;
        else if (b == BTN_UP && menu_idx > 0)
            menu_idx--;

        screenNeedsRefresh = true;
        return;
    }

    /* ================= DEVICE SET MENU ================= */
    if (ui == UI_DEVSET_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
            menu_select();
        else if (b == BTN_DOWN && devset_idx < DEVSET_MENU_COUNT - 1)
            devset_idx++;
        else if (b == BTN_UP && devset_idx > 0)
            devset_idx--;

        screenNeedsRefresh = true;
        return;
    }

    /* ================= COUNTDOWN EDIT (DOWN INCREASE) ================= */
    if (ui == UI_COUNTDOWN_EDIT_MIN)
    {
        if (b == BTN_DOWN)
            increase_edit_value(1);
        else if (b == BTN_DOWN_LONG)
            increase_edit_value(1);
        else if (b == BTN_SELECT)
            ui = UI_COUNTDOWN;

        screenNeedsRefresh = true;
        return;
    }

    /* ================= OTHER EDIT SCREENS ================= */
    if (ui != UI_DASH)
    {
        if (b == BTN_UP)
            increase_edit_value(1);
        else if (b == BTN_DOWN)
            decrease_edit_value(1);
        else if (b == BTN_UP_LONG)
            increase_edit_value(5);
        else if (b == BTN_DOWN_LONG)
            decrease_edit_value(5);
        else if (b == BTN_SELECT)
            menu_select();

        screenNeedsRefresh = true;
        return;
    }
}

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    /* Auto exit countdown when finished */
    if (ui == UI_COUNTDOWN && !countdownActive)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    bool cursorBlinkActive = (ui == UI_MENU);

    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS))
    {
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        draw_menu_cursor();
    }

    if (ui == UI_WELCOME && (now - lastLcdUpdateTime >= WELCOME_MS))
    {
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if ((ui == UI_DASH || ui == UI_COUNTDOWN) &&
        (now - lastLcdUpdateTime >= 1000))
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    if (screenNeedsRefresh || ui != last_ui)
    {
        bool fullRefresh = (ui != last_ui);

